bad
worst
great
waste
awful
excellent
wonderful
worse
terrible
best
boring
stupid
nothing
horrible
poor
minutes
crap
even
love
supposed
perfect
poorly
acting
ridiculous
beautiful
plot
lame
amazing
loved
script
favorite
well
pointless
avoid
worst_movie
annoying
superb
highly
brilliant
badly
also
dull
mess
wasted
oh
money
thing
fantastic
life
laughable
pathetic
unless
least
2
cheap
instead
bad_acting
must_see
redeeming
performance
always
today
beautifully
bad_movie
reason
performances
make
enjoyed
could
touching
fails
save
wonderfully
anything
garbage
young
really_bad
10_10
1
world
unfortunately
years
looks_like
excuse
powerful
predictable
perfectly
decent
dumb
heart
highly_recommend
sorry
outstanding
terrific
7
recommended
low
still
guess
job
i'm
mean
bother
attempt
8
strong
joke
definitely
guy
4
like
3
bunch
idea
true
unique
better
greatest
ok
gives
looks
classic
especially
disappointment
moving
delightful
someone
would
wooden
whatsoever
half
sucks
beauty
unbelievable
apparently
gem
different
disappointing
fun
stunning
gore
great_film
bored
mediocre
fake
either
story
role
family
seriously
great_movie
masterpiece
none
works
oscar
simple
shows
subtle
rare
enjoy
plain
finest
wrong
failed
there's
plays
flat
budget
look_like
supporting
trash
sweet
enjoyable
hour
weak
can't
memorable
father
portrayal
problem
something
incredible
first_time
rubbish
fine
solid
lack
silly
emotions
looked
awesome
that's
nowhere
except
completely
lives
painful
remarkable
relationship
ever_seen
low_budget
realistic
helps
bland
played
effort
trying
well_done
total
journey
random
much_better
premise
watching
noir
saying
fascinating
many
charming
actually
honestly
paid
cliché
write
effects
provides
tragic
okay
complex
series
tale
flick
please
man
nudity
rent
seconds
favourite
want
episodes
yeah
brings
else
blame
tried
barely
ugly
atmosphere
future
although
maybe
seemed
9
hell
obviously
emotional
may
enough
lacks
intense
later
hoping
human
makes
meets
feelings
easy
city
deeply
recommend
pretty
natural
romantic
sat
themes
brain
wonder
explanation
day
producers
compelling
unlike
whole_movie
dialogue
quite
gorgeous
tries
roles
grade
lovely
drama
john
winning
horror_movie
absurd
whole
funniest
tears
bottom
basically
often
adventure
obvious
going
believable
bit
horror
liked
society
loving
rented
personal
treat
new
thinking
complete
unusual
paul
war
spent
making
small
unnecessary
original
live
zombies
whole_thing
supporting_cast
hilarious
dialog
impact
surprising
disappointed
history
joy
they're
point
i've_ever
shoot
appreciate
made
let's
adds
sit
looking
camera
porn
supposedly
surprisingly
sex
editing
vhs
video
quiet
sees
special_effects
fresh
finds
impressed
say
tells
age
tragedy
neither
nonsense
sometimes
somebody
become
happy
cgi
care
effective
nature
throw
nicely
times
believe
call
terribly
edge
confusing
era
childhood
get
late
b
god
stick
i've_ever_seen
entire
experience
good_thing
review
witty
holds
whatever
genius
writing
movie_ever
available
entertaining
famous
among
us
magic
early
might
films
begins
disaster
utterly
brought
viewing
season
cast
cover
pretty_much
truly
rip
lines
ways
felt_like
william
scary
90
animation
new_york
makers
impressive
jokes
monster
deep
killer
cheesy
sequel
others
writers
killing
delivers
ever
suppose
frank
surprised
light
cry
score
award
together
dark
seems_like
explained
sadly
seems
wanted
what's
clichés
mistake
animated
relationships
modern
cinema
dead
simply
try
top
potential
blood
recently
imdb
touch
french
i'll
including
torture
yet
tony
jean
cut
music
york
takes
knowing
reality
character_development
somewhere
minute
f
thin
episode
positive
present
james
inspired
innocent
apartment
musical
important
word
find
past
channel
really
moves
thanks
years_later
totally
images
genre
main_character
remake
ago
walk
master
miss
lovers
romance
success
head
killed
released
events
dreams
zero
happens
paced
otherwise
rest
cinematography
possibly
piece
keeps
know
murder
crime
offers
single
twists
let
two
hated
century
kill
david
memories
good_job
real_life
brothers
lacking
sense
view
jack
familiar
remember
dvd
moved
stands
watchable
stay
something_like
name
friend
pleasure
particular
able
charm
mouth
marriage
keeping
accent
hardly
sent
actors
talking
holes
guys
skip
absolutely
act
love_story
years_ago
said
naked
saved
laugh
robert
follows
popular
look
empty
development
known
caught
real
slasher
car
slow
chance
loves
explain
michael
30
decided
credits
sort
dream
kind
shots
sitting
tired
married
england
mention
really_good
social
start
whose
spoilers
growing
fellow
5
hours
intelligent
hey
older
pace
dealing
got
wow
zombie
certainly
style
filmmakers
share
project
director
walking
kills
attempts
funny
thrown
visual
pay
along
see
approach
soundtrack
business
spend
purpose
sleep
victims
release
stuff
horror_movies
anyway
thoroughly
stories
tell
movies
soon
living
shame
certain
detail
wondering
country
mother
theme
straight
reminds
wife
stop
give
remains
far
running
creature
moments
realism
american
deal
die
rating
academy
smile
received
somehow
glad
nobody
production
puts
similar
equally
one_scene
pass
left
computer
i've
songs
exciting
scenes
kid
female
younger
sick
spoiler
picture
visit
storyline
british
incredibly
brutal
around
ask
documentary
saving
play
i'd
flaws
grand
key
shot
comedies
reviews
concept
spirit
wearing
feel
called
bad_guys
richard
critics
passion
support
born
started
course
dramatic
material
deserved
art
directing
plenty
beyond
comic
year_old
america
period
sounds
mr
shown
de
suddenly
must
television
comedic
peter
needed
biggest
desire
situation
forced
giant
created
home
saw
children
go
already
forward
five
turned
anyone
culture
portrayed
escape
vision
much
gets
i'm_sure
silent
sure
collection
we're
days
lighting
comedy
based
includes
anything_else
ideas
truth
end
average
festival
huge
deserves
lived
filming
pure
happened
difficult
wait
cuts
western
confused
central
movie_like
trip
example
1_2
led
dies
put
note
engaging
sister
van
summer
interesting
clearly
law
less
store
writer
one_point
narrative
names
learn
stuck
evil
thought
english
list
showed
angry
interested
girls
power
drunk
copy
reminded
fair
clothes
following
charles
special
bright
finish
